IDEA StatiCa Open Model
OpenModel.RigidLink Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 List of Rigid link
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<RigidLink> RigidLink { get; set; }
Public Property RigidLink As List(Of RigidLink)
	Get
	Set
public:
property List<RigidLink^>^ RigidLink {
	List<RigidLink^>^ get ();
	void set (List<RigidLink^>^ value);
}
Property Value
Type: List<RigidLink>
See Also
Reference
OpenModel Class
IdeaRS.OpenModel Namespace